PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_tcpwm_shiftreg.h
/*******************************************************************************
* Function Name: Cy_TCPWM_ShiftReg_LineOutStatus
****************************************************************************//**
*
* Returns the current level of the selected Shift Register output line.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param shiftRegOutSelect
* Defines which Shift Register output line is being checked: line_out or line_out_inv.
*
* \return
* The current Shift Register output line level.
*
* \snippet tcpwm/shiftreg/snippet/main.c snippet_Cy_TCPWM_ShiftReg_LineOutStatus
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_TCPWM_ShiftReg_LineOutStatus(TCPWM_Type const *base, uint32_t cntNum, uint32_t shiftRegOutSelect)
{
    uint32_t status = 0UL;

    status = TCPWM_GRP_CNT_STATUS(base, TCPWM_GRP_CNT_GET_GRP(cntNum), cntNum);

    switch (shiftRegOutSelect)
    {
    case CY_TCPWM_SHIFTREG_LINE_OUT:
        status = _FLD2VAL(TCPWM_GRP_CNT_V2_STATUS_LINE_OUT, status);
        break;
    case CY_TCPWM_SHIFTREG_LINE_OUT_INV:
        status = _FLD2VAL(TCPWM_GRP_CNT_V2_STATUS_LINE_COMPL_OUT, status);
        break;
    default:
        /* Not a Valid Line output */
        CY_ASSERT_L3(false);
        break;
    }
    return status;
}

#endif /* CY_IP_MXTCPWM_VERSION >= 2U */

#if defined (CY_IP_MXS40TCPWM) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_TCPWM_Shiftreg_EnableSwap
****************************************************************************//**
*
* Enables/disables swapping mechanism between CC0 and buffered CC0, CC1 and buffered CC1, PERIOD and buffered PERIOD, DT and buffered DT.
*
* \param base
* The pointer to a TCPWM instance.
*
* \param cntNum
* The Counter instance number in the selected TCPWM.
*
* \param enable
* true = swap enabled; false = swap disabled
*
*
*******************************************************************************/
__STATIC_INLINE void Cy_TCPWM_Shiftreg_EnableSwap(TCPWM_Type *base, uint32_t cntNum,  bool enable)
{
    Cy_TCPWM_Block_EnableSwap(base, cntNum, enable);
}
#endif /* defined (CY_IP_MXS40TCPWM) */

/** \} group_tcpwm_functions_shiftreg */

/** \} group_tcpwm_shiftreg */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXTCPWM */

#endif /* CY_TCPWM_SHIFTREG_H */

/* [] END OF FILE */
